// input
string monthOfVacantion = Console.ReadLine();   //  May, June, July, August, September или October
int countOfNights = int.Parse(Console.ReadLine());

//calcolations
( double apartmentPrice, double StudioPrice) = (countOfNights, monthOfVacantion) switch
{
    ( <=  7, "May")         => (65,          50),
    ( <= 14, "May")         => (65,          50 * 0.95),
    ( >  14, "May")         => (65 * 0.9,    50 * 0.7),
    ( <= 14, "June")        => (68.70,       75.20),
    ( >  14, "June")        => (68.70 * 0.9, 75.20 * 0.8),
    ( <= 14, "July")        => (77,          76),
    ( >  14, "July")        => (77 * 0.9,    76),
    ( <= 14, "August")      => (77,          76),
    ( >  14, "August")      => (77 * 0.9,    76),
    ( <= 14, "September")   => (68.70,       75.20),
    ( >  14, "September")   => (68.70 * 0.9, 75.20 * 0.8),
    ( <=  7, "October")     => (65,          50),
    ( <= 14, "October")     => (65,          50 * 0.95),
    ( >  14, "October")     => (65 * 0.9,    50 * 0.7),
};

//output
Console.WriteLine($"Apartment: {countOfNights * apartmentPrice:f2} lv.");
Console.WriteLine($"Studio: {countOfNights * StudioPrice:f2} lv.");

//contition
/*
Хотел предлага 2 вида стаи: студио и апартамент. 
Напишете програма, която изчислява цената за целия престой за студио и апартамент. 
*/
/*
Цените зависят от месеца на престоя:

                Май и октомври 	        Юни и септември	        Юли и август

Студио –        50 лв./нощувка	        75.20 лв./нощувка	    76 лв./нощувка
Апартамент –    65 лв./нощувка	        68.70 лв./нощувка	    77 лв./нощувка

*/
/*
Предлагат се и следните отстъпки:

•	За студио, при повече от 7 нощувки през май и октомври : 5% намаление.
•	За студио, при повече от 14 нощувки през май и октомври : 30% намаление.
•	За студио, при повече от 14 нощувки през юни и септември: 20% намаление.
•	За апартамент, при повече от 14 нощувки, без значение от месеца : 10% намаление.
*/
/*
Вход
Входът се чете от конзолата и съдържа точно 2 реда, въведени от потребителя:
•	На първия ред е месецът – May, June, July, August, September или October
•	На втория ред е броят на нощувките – цяло число в интервала [0 ... 200]
*/
/*
Изход
Да се отпечатат на конзолата 2 реда:
•	На първия ред: “Apartment: {цена за целият престой} lv.”
•	На втория ред: “Studio: {цена за целият престой} lv.“
Цената за целия престой форматирана с точност до два знака след десетичната запетая.
*/



int i = 0;
for (; i < 10; )
{
    i++;


}



while (true)
{
    



    if ( i <= 10)
    {
        break;
    }
    i++;
}
